Repository: inveniosoftware/invenio-files-rest
Catalog: invenio_files_rest/translations/*/LC_MESSAGES/messages.po
Languages: ar, hu, sv, tr

source: Invalid location name.
ar: إسم الموضع غير صالح.
hu: Érvénytelen helynév
sv: Ogiltigt platsnamn.
tr: Geçersiz konum adı.

source: ID
ar: معرّف ID

source: URI
ar: معرّف موضع المورد URI

source: UUID
ar: المعرّف الفريد العالمي UUID

source: Location
ar: الموضع
hu: Hely
sv: Plats
tr: Konum

source: Storage Class
ar: صنف التّخزين
hu: Készlet Osztály
sv: Lagringsklass
tr: Depolama Sınıfı

source: Version
ar: نسخة
hu: Verzió
tr: Sürüm

source: File UUID
ar: المعرّف الوحيد UUID للملف
hu: Fájl UUID
sv: UUID Fil
tr: Dosya UUID'si

source: Size
ar: الحجم
hu: Méret
sv: Storlek
tr: Boyut

source: Deleted
ar: تمّ الحذف
hu: Törölve
sv: Raderad
tr: Silinen

source: Checksum
ar: ‫تدقيق‬ المجموع
hu: Ellenőrzési eredmény
tr: Sağlama Toplamı

source: Readable
ar: مقروء
hu: Olvasható
sv: Läsbar
tr: Okunabilir

source: Storage class
ar: صنف التّخزين
hu: Készlet osztály
sv: Lagringsklass
tr: Depolama sınıfı

source: Objects
ar: أشياء
hu: Objektumok
sv: Objekt
tr: Nesneler

source: File
ar: ملفّ
hu: Fájl
sv: Fil
tr: Dosya

source: Fixity
ar: ثبات
hu: Szilárdság
tr: Sabitlik

source: Checked
ar: تمّ التأكّد
hu: Ellenőrizve
sv: Kontrollerade
tr: Kontrol

source: Run fixity check
ar: تدقيق‬ الثبات
hu: Szilárdság ellenőrzésének futtatása
sv: Kör fixity kontroll
tr: Sabitlik kontrolünü çalıştır

source: Cannot find file instance.
ar: لا يمكن العثور على الملف.
hu: Nem található fájl eset.
sv: Kan inte hitta filinstansen.
tr: Dosya örneği bulunamıyor.

source: Fixity check(s) sent to queue.
ar: أرسلت عمليات التدقيق‬ من الثبات إلى قائمة الانتظار.
hu: A javítási ellenőrzés(ek) elküldve a sorba.
sv: Fixitetskontroll(er) skickas till kön.
tr: Sabitlik kontrolü/kontrolleri kuyruğa alındı.

source: Failed to run fixity checks.
ar: إخفاق في تشغيل عمليات التدقيق‬ من الثبات.
hu: Hiba a szilárdság ellenőrzésének lefuttatásában.
sv: Det gick inte att köra fixity kontroller.
tr: Sabitlik kontrolleri çalıştırılamadı.

source: Complete
ar: تمّ
hu: Kész
sv: Komplett
tr: Tamamlananlar

source: Files
ar: الملفّات
hu: Fájlok
sv: Filer
tr: Dosyalar

source: File size limit exceeded.
ar: تم تجاوز الحد الأقصى لحجم الملف.
hu: Túllépte a fájlméret limitet.
sv: Gränsen för filstorlek har överskridits.
tr: Dosya boyutu sınırı aşıldı.

source: File is bigger than expected.
ar: الملف أكبر من المتوقع.
hu: A fájl nagyobb a vártnál.
sv: Filen är större än förväntat.
tr: Dosya boyutu beklenenden daha büyük.

source: File is smaller than expected.
ar: الملف أصغر من المتوقع.
hu: A fájl kisebb a vártnál.
sv: Filen är mindre än förväntat.
tr: Dosya boyutu beklenenden daha küçük.

source: Could not send file: %(error)s
ar: لم يتمكن من إرسال الملف: %(error)s
hu: Nem sikerült elküldeni a fájlt: %(error)s
sv: Kunde inte skicka filen: %(error)s
tr: Dosya gönderilemedi: %(error)s

source: Could not compute checksum of file: %(error)s
ar: لم يتمكن من حساب المجموع الاختباري للملف: %(error)s
hu: Nem sikerült kiszámítani a fájl ellenőrző összegét: %(error)s
sv: Kunde inte räkna ut filens checksumma: %(error)s
tr: Dosyanın sağlama toplamı hesaplanamadı: %(error)s
